import React from 'react'
import Header from '../../home/components/Header'
import useFetch from '../../../customHook/useFetch'
import { useParams } from 'react-router-dom'
import moment from 'jalali-moment'
export default function BlogDetail() {
  const param = useParams()
  const { blogs } = useFetch()
  const blog = blogs.find(item => item.id == param.id)
  console.log(blog)
  return (
    <div className='w-full h-full bg-stone-950 text-white'>
      <Header />
      <article className="px-4 py-24 mx-auto max-w-7xl  rounded-b-2xl "  >
        <div className="w-full mx-auto mb-12 text-center md:w-3/4 lg:w-1/2 ">
          <img src="../../../../public/blog3.jpeg" className="object-cover w-full h-96 bg-center rounded-lg" alt="blog" />
          <p className="mt-6 mb-2 text-xs font-semibold tracking-wider uppercase text-primary">Development</p>
          <h1 className="mb-3 text-3xl font-bold leading-tight text-white md:text-4xl" title="Rise of Tailwind - A Utility First CSS Framework">
            {blog ? blog.title : '...'}
          </h1>
          <a className="flex items-center text-gray-700">

            <div className="ml-2 flex flex-col justify-end w-full ">
              <p className="text-sm font-semibold text-white">{blog && blog.category_id}</p>
              {/* <p>{moment(blog.created_at * 1000).locale('fa').format('YYYY/MM/DD')}</p> */}
            </div>
          </a>
        </div>

        <div className="w-full mx-auto prose md:w-3/4 lg:w-full text-right leading-10 tracking-wider ">
          <p>چرا توجه به MVP در کسب‌وکارها اهمیت دارد؟
            تقریبا ۷۰ درصد استارتاپ‌ها با شکست مواجه می‌شوند و این شکست می‌تواند دلایل مختلفی داشته باشد. عدم تناسب محصول با بازار یکی از این دلایل است که با استفاده از ایده MVP می‌توان تا حد زیادی از آن جلوگیری کرد. همان‌طور که متوجه شده‌اید ایده MVP این است که تیم قبل از توسعه نهایی محصول، بازخورد کاربران را دریافت کند. کمینه محصول پذیرفتنی به مهندسان و سایر اعضای تیم محصول کمک می‌کند تا روند توسعه را ساده‌تر کنند. سپس این محصول در بازار آزمایش می‌شود تا ببینند آیا پتانسیل موفقیت را دارد یا خیر؟

            اطمینان از ماندگاری محصول یکی از ویژگی‌های کلیدی MVP است. کاری که یک محصول انجام می‌دهد، اهمیت بیشتری نسبت به نحوه انجام آن دارد. کمینه محصول پذیرفتنی به شما کمک می‌کند تا اطلاعات اولیه‌ای درباره علاقه کاربران به محصول دریافت کنید. نتایج مثبت در این مرحله چراغ سبز را برای توسعه نسخه کامل نشان می‌دهد. از دلایل اهمیت MVP در کسب‌وکارها می‌توان به موارد زیر اشاره کرد:

            با اطمینان از سرمایه‌گذاری در پروژه‌ای که احتمال موفقیت دارد، در وقت و منابع خود صرفه‌جویی می‌کنید.
            می‌توانید بفهمید که آیا محصول برای کاربران جذاب است یا خیر.
            هنگام توسعه نسخه کامل محصول، می‌توانید از اطلاعات به دست آمده استفاده کنید.
            می‌توانید مشتریان بالقوه را شناسایی کرده و با آن‌ها ارتباط برقرار کنید.
            می‌توانید سرمایه‌گذاران را زودتر جذب کنید.
            مدیر MVP کیست و چه مهارت‌هایی باید داشته باشد؟
            مدیر MVP مدیر محصولی است که مسئولیت تولید کمینه محصول پذیرفتنی را به عهده دارد. این فرد باید مجموعه‌ای از مهارت‌های متنوع مانند دانش فنی، دانش کسب‌وکار و دانش تجربه کاربری داشته باشد. باتوجه‌به اینکه یادگیری هرکدام از این مهارت‌ها وقت و انرژی زیادی می‌برد، پس مدیر MVP باید بتواند از هر مجموعه، مهارت‌های لازم را فرا گرفته و در عمل پیاده کند.

            مهارت‌های فنی
            در بخش تکنولوژی، مدیر MVP باید در حد نیاز به دانش فنی مسلط باشد. توجه به نکات زیر می‌تواند برای هر مدیر محصولی که در حال تولید کمینه محصول پذیرفتنی است، مفید باشد:

            پشته (Stack)
            زمانی که مهندسان از پشته صحبت می‌کنند، در واقع به لایه‌های فناوری اشاره دارند که باعث انجام دادن کاری می‌شود. از لحظه‌ای که مشتری به صفحه فرود (landing) وارد می‌شود تا زمانی که حساب کاربری خود را حذف می‌کند، فناوری‌های موجود در پشته همه‌چیز را مدیریت می‌کنند. برای یادگیری سریع پشته، باید از تیم مهندسی بخواهید که لایه‌های فناوری را برای شما نام ببرند و شما را از اصطلاحات فنی باخبر کنند. دانستن پشته به شما کمک می‌کند تا مسیر را به‌راحتی دنبال کنید. در نتیجه مدیریت MVP برایتان راحت‌تر از قبل می‌شود.

            معماری سیستم
            اگر پشته نشان‌دهنده فناوری‌های مورداستفاده باشد، معماری سیستم نشان می‌دهد که این فناوری‌ها چگونه برای همکاری با یکدیگر طراحی شده‌اند. پشته بیشتر با قابلیت‌های فنی خام در ارتباط است، درحالی‌که در طراحی معماری سیستم، رفتار موردنظر مشتری گنجانده شده است.

            برای اینکه بتوانید معماری سیستم را به‌سرعت یاد بگیرید، بهتر است از تیم مهندسی بخواهید تا معماری محصول را برای شما ترسیم کنند. با درک محصول به‌عنوان یک سیستم شما می‌توانید تصمیمات بهتری برای هرکدام از اجزای آن بگیرید. در شرکت‌های بزرگ به تعداد این اجزا، تیم وجود دارد که باید بتوانید تمام آن‌ها را در راستای هدف اصلی همسو کنید.

            مدل داده و APIهای آن
            یک مدل داده اطلاعات مورداستفاده محصول را سازمان‌دهی کرده و نحوه ارتباط آن‌ها با یکدیگر را استانداردسازی می‌کند. هرکدام از اطلاعات مانند کاربران، محصولات، کارت‌های اعتباری و… یک موجودیت به حساب می‌آیند و به‌طور ساختارمندی با یکدیگر در ارتباط هستند. APIها چگونگی رابطه هر دو جزء را نشان می‌دهند و تعامل محصول را با دنیای بیرون امکان‌پذیر می‌کنند. با تمرکز بر APIها و یادگیری چگونگی فعالیت آن‌ها می‌توانید استفاده از اطلاعات را بهینه‌تر کرده و دسترسی به آن‌ها را برای خود راحت‌تر کنید.

            مهارت‌هایی که نباید روی آن‌ها تمرکز کنید
            یادگیری تمام مهارت‌های فنی برای مدیر MVP هیچ ضرورت و اهمیتی ندارد. برنامه‌نویسی یکی از مهارت‌هایی است که بیشتر افراد فکر می‌کنند برای مدیریت محصول ضروری است. در صورتی که برای تبدیل شدن به یک مدیر محصول موثر، داشتن چنین دانشی لازم نیست.

            مهارت‌های کسب‌وکار
            دومین دسته از مهارت‌هایی که باید یک مدیر MVP داشته باشد، مهارت‌هایی در حوزه کسب‌وکار است. برای یادگیری مهارت‌های این حوزه تنها کافی است روی موارد زیر تمرکز کنید:

            مدیریت پروژه
            یادگیری مدیریت پروژه کار سخت و زمان‌بری است. اما کسی که نتواند یک پروژه را به‌خوبی مدیریت کند، هرگز یک مدیر محصول خوب نخواهد بود. مطالعه در این زمینه لازم ولی ناکافی است. در واقع تسلط بر مدیریت پروژه بیش از هرچیز به تجربه نیاز دارد. با این حال، با ارتباط با ذی‌نفعان و اعضای تیم و همچنین یادگیری اصول توسعه محصول می‌توانید با تیم خود همدل باشید و فرایندهای انجام پروژه را در سطح بالایی بیاموزید.

            تاثیر مدل‌سازی
            کارهایی که قابلیت اندازه‌گیری ندارند، به‌ندرت به‌خوبی انجام می‌شوند. پس برای هر محصول باید اهدافی کمی در نظر بگیرید. به این منظور می‌توانید هزینه‌هایی را که برای هر محصول وجود دارد، محاسبه کنید و پیش‌بینی‌هایی برای قیمت آینده آن و میزان نیروی انسانی موردنیاز داشته باشید. ایجاد چنین الگویی پتانسیل محصول و ارزش آن را سنجیده و آن‌ها را با انتظارات ذی‌نفعان تطبیق می‌دهد.

            جمع‌آوری و تحلیل داده‌ها
            مدیر MVP باید بتواند برای تصمیم‌گیری سریع، به جمع‌آوری داده‌ها بپردازد. استفاده از دیگران برای انجام این کار نه‌تنها باعث صرفه‌جویی در زمان نمی‌شود، بلکه کیفیت کار را تا حد زیادی پایین می‌آورد. چون به دست آوردن دید و بینش لازم برای مدیریت محصول تنها از طریق درگیر شدن با داده‌های مختلف امکان‌پذیر است؛ حتی یک گزارش کامل و بی‌نقص هم نمی‌تواند چنین بینشی به شما بدهد.

            از طرفی، شما به‌عنوان مدیر MVP هرروز باید درمورد چگونگی رفتار محصول در یک سناریو خاص تصمیم‌گیری کنید. مهارت جمع‌آوری و تحلیل داده باعث می‌شود شما بتوانید تیم خود را در مسیر درست قرار دهید.

            مهارت‌های تجربه کاربری (UX)
            نکته مهم در طراحی و تولید محصول کاربردپذیری و قابلیت استفاده راحت از آن توسط مشتری است. آشنایی با تجربه کاربری از مهارت‌های ضروری برای مدیر MVP است که باید توجه ویژه‌ای به آن‌ها داشته باشد:

            آشنایی با الگوهای طراحی محصول
            الگوهای طراحی محصول همان چگونگی استفاده از اجزای بصری و تعاملی در محصول هستند؛ مانند اندازه و فونت دکمه‌ها، تعداد بخش‌های یک فرم، چگونگی ارسال ایمیل به کاربر و… این الگوها ممکن است در طول زمان به‌صورت برنامه‌ریزی‌شده یا غیربرنامه‌ریزی‌شده طراحی شوند.

            شناختن الگوهای محصول به شما کمک می‌کند تا چگونگی استفاده کاربران از محصول و میزان موثر بودن ویژگی‌های جدید آن را در طول زمان درک کنید. با رشد محصول، استفاده مداوم از الگوها اهمیت بیشتری پیدا می‌کند. چون ویژگی‌های جدید محصول باید با سایر بخش‌های قدیمی‌تر هم‌خوانی و هماهنگی داشته باشد. همچنین الگوهای طراحی باید با الگوهای فنی هماهنگ شوند که این کار با استفاده از کتابخانه‌های مخصوص به‌راحتی قابل‌انجام است.

            آشنایی با چگونگی اجرای تحقیقات تجربه کاربری
            به‌عنوان مدیر محصول اگر مشتری خود را درک نکنید، هرگز نخواهید توانست یک محصول عالی بسازید. مصاحبه حضوری با یک یا چند مشتری، تجزیه‌وتحلیل میلیون‌ها اقدام کاربر و درک اصول یک تحقیق خوب از مهم‌ترین کارهای یک مدیر MVP است. تحقیق موثر جنبه‌های بسیار زیادی دارد، اما توصیه می‌کنیم تنها روی موارد زیر تمرکز کنید:

            چگونگی پرسیدن سوالات بی‌طرفانه در نظرسنجی‌ها و مصاحبه‌ها
            درک اندازه نمونه و نحوه محاسبه اهمیت آماری
            چگونگی نرمال‌سازی داده‌ها
            آشنایی با چگونگی ساخت نمونه اولیه از ایده‌ها
            مدیر محصول باید بتواند ایده‌های خود را به شیوه‌ای موثر و با استفاده از نمونه‌های تصویری بیان کند. البته انتقال شفاهی یا حتی نوشتاری تجربه محصول کار بسیار دشواری است و نیاز به مهارت بالای مدیر MVP در انتقال اطلاعات دارد. علاوه بر این،‌ طراحی همیشه باید جلوتر از کارهای فنی انجام شود. اما در بسیاری از محصولات، بعضی از قسمت‌های طراحی موازی با توسعه پیش می‌رود. اگر طراحی از توسعه عقب بماند، مدیر MVP باید بتواند در نقش کارآموز طراحی به تیم کمک کند.

            با ساخت یک نمونه اولیه مناسب و نشان دادن صریح ایده اصلی به اعضای تیم می‌توانید بازخورد بهتری از آن‌ها دریافت کنید. البته لازم نیست یک طراح بصری عالی باشید و همین‌قدر که بتوانید ایده کلی خود را به تیم برسانید، کافی است. این کار علاوه بر بالا بردن کیفیت محصول، هدر رفتن تلاش‌ها و منابع سازمان را کاهش می‌دهد.

            کلام آخر
            یادگیری تمام این مهارت‌ها قطعا کار آسانی نیست و به سال‌ها تلاش و تجربه نیاز دارد. با برنامه‌ریزی و آموزش گام‌به‌گام می‌توانید الزامات یک مدیر MVP موفق را برآورده کرده و حین آموزش، آن‌ها را برای توسعه محصول خود هم به کار بگیرید. به نظر شما چه مهارت‌های دیگری برای یک مدیر MVP لازم است؟ تجربیات خود را با ما به اشتراک بگذارید
            </p>
        </div>
      </article>
    </div>


  )
}
